package com.example.SCM.enumClass;

public enum CustomerOrderStatus {
    PENDING,            // অর্ডার সাবমিট হয়েছে, পেমেন্ট বা ভেরিফিকেশন বাকি
    CONFIRMED,          // অর্ডার নিশ্চিত করা হয়েছে
    PROCESSING,         // ওয়্যারহাউজে প্যাকিং ও ইনভেন্টরি এলোকেশন চলছে (নতুন)
    SHIPPED,            // কুরিয়ার বা ট্রান্সপোর্ট হাবে হ্যান্ডওভার করা হয়েছে
    OUT_FOR_DELIVERY,   // রাইডার কাস্টমারের ঠিকানার উদ্দেশ্যে রওনা দিয়েছে
    DELIVERED,          // কাস্টমার সফলভাবে প্রোডাক্ট রিসিভ করেছে
    CANCELLED,          // ডেলিভারির আগে অর্ডার বাতিল করা হয়েছে
    RETURNED,           // কাস্টমার প্রোডাক্ট নেয়নি বা রিটার্ন এসেছে
    REFUNDED            // কাস্টমারকে পেমেন্ট রিফান্ড করা হয়েছে

   
}
